// Вывести квадрат числа
Console.WriteLine("введите число");
double a = Convert.ToDouble(Console.ReadLine());
Console.WriteLine(a * a);
